GLENDA/glendaRequestTokenTemplate.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://www.w3.org/2003/05/soap-envelope">
  <soap-env:Body>
    <ns0:Authenticate xmlns:ns0="http://www.exchangenetwork.net/schema/node/2">
      <ns0:userId>{{USERNAME}}</ns0:userId>
      <ns0:credential>{{PASSWORD}}</ns0:credential>
      <ns0:domain xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
      <ns0:authenticationMethod>password</ns0:authenticationMethod>
    </ns0:Authenticate>
  </soap-env:Body>
</soap-env:Envelope>
